/*this page is done by Name:Sara Yasser     ID:20140140 */

import React, { Component } from 'react';
import Header from './Header';
import Footer from './Footer';
import BlogDetailsVideo from './blogDetailsVideo';
import FaFacebookSquare from 'react-icons/lib/fa/facebook-square';
import TiSocialTwitter from 'react-icons/lib/ti/social-twitter';
import FaPaperPlane from 'react-icons/lib/fa/paper-plane';
import './../css/blogDetails.css';


class BlogDetails extends Component {
    render() {
       return (
                <div className="container">
                        <Header />
                         <div className="Content">
                            <img id="phoneImg" alt="Phone" src={require("./../images/intro-blogdetails/phone.JPG")}/>
                            <p id="titel_e7gzly">احجز رقمك الآن واحصل على مهلة 3 أيام لدفع الرسوم. بإمكانك دفع الرسوم لدى أي من أكشاك فيرجن موبايل أو داخل أكثر من 25 فرع من فروع مكتبة جرير
                            </p>
                        </div>

                        <div id="icon-minute">
                            <div className="oneMinAgo">
                                1 min ago
                            </div>
                            <div class="icons" id="oneMinIcons">
                                   <ul>
                                     <li><i id="facebook" > <FaFacebookSquare color="#fff" /> </i></li>
                                     <li><i id="twitter" > <TiSocialTwitter color="#fff" /> </i></li>
                                     <li><i id="telegram"> <FaPaperPlane color="#fff" /> </i></li>
                                   </ul>
                            </div>       

                        </div>
                        <p className="text">
                                    احجز رقمك ال
                                    آن واحصل على مهلة 3 أيام لدفع الرسوم. 
                                    بإمكانك دفع الرسوم لدى أي من أكشاك فيرجن موبايل أو داخل أكثر من 
                                    25 فرع من فروع مكتبة جرير في انحاء المملكة سيتم إرسال رمز التفعيل 
                                    من خلال رسالة نصية بالإضافة إلى البريد الإلكتروني. احتفظ برمز التفعيل وبطاقة الهوية وذلك لإستلام رقمك عند زيارتك لأحد اكشاكنا. سوف يتم إلغاء حجزك إذا لم تستلمه خلال المهلة المذكورة علماً 
                                    بأن الرقم سيكون متاح للحجز مرة أخرى بعد انتهاء المهلة. احجز رقمك الآن واحصل على مهلة 3 أيام لدفع الرسوم. بإمكانك دفع الرسوم لدى أي من أكشاك فيرجن موبايل أو داخل أكثر من 25 فرع من فروع مكتبة جرير في انحاء المملكة سيتم إ
                                    رسال رمز التفعيل من خلال رسالة نصية بالإضافة إلى البريد الإلكتروني. احتفظ برمز التفعيل وبطاقة الهوية وذلك لإستلام رقمك عند زيارتك لأحد اكشاكنا. سوف يتم إلغاء حجزك إذا لم تستلمه خلال المهلة المذكورة علماً بأن الرقم سيكون متاح للحجز مرة أخرى بعد انتهاء المهلة. احجز رقمك الآن واحصل على مهلة 3 أيام لدفع الرسوم. بإمكانك دفع الرسوم لدى أي من أكشاك فيرجن موبايل أو داخل أكثر من 25 فرع من فروع مكتبة جرير في انحاء المملكة سيتم إرسال رمز التفعيل من خلال رسالة نصية بالإضافة إلى البريد الإلكتروني. احتفظ برمز التفعيل وبطاقة الهوية وذلك لإستلام رقمك عند زيارتك لأحد اكشاكنا. سوف يتم إلغاء حجزك إذا لم تستلمه خلال المهلة المذكورة علماً بأن الرقم سيكون متاح للحجز مرة أخرى بعد انتهاء المهلة. احجز رقمك الآن واحصل على مهلة 3 أيام لدفع الرسوم. بإمكانك دفع الرسوم لدى أي من أكشاك فيرجن موبايل أو داخل أكثر من 25 فرع من فروع مكتبة جرير في انحاء المملكة سيتم إرسال رمز التفعيل من خلال رسالة نصية بالإضافة إلى البريد الإلكتروني. احتفظ برمز التفعيل وبطاقة الهوية وذلك لإستلام رقمك عند زيارتك لأحد اكشاكنا. سوف يتم إلغاء حجزك إذا لم تستلمه خلال المهلة المذكورة علماً بأن الرقم سيكون متاح للحجز مرة أخرى بعد انتهاء المهلة. احجز رقمك الآن واحصل على مهلة 3 أيام لدفع الرسوم. بإمكانك دفع الرسوم لدى أي من أكشاك فيرجن موبايل أو داخل أكثر من 25 فرع من فروع مكتبة جرير في انحاء المملكة سيتم إرسال رمز التفعيل من خلال رسالة نصية بالإضافة إلى البريد الإلكتروني. احتفظ برمز التفعيل وبطاقة الهوية وذلك لإستلام رقمك عند زيارتك لأحد اكشاكنا. سوف يتم إلغاء حجزك إذا لم تستلمه خلال المهلة المذكورة علماً بأن الرقم سيكون متاح للحجز مرة أخرى بعد انتهاء المهلة. احجز رقمك الآن واحصل على مهلة 3 أيام لدفع الرسوم. بإمكانك دفع الرسوم لدى أي من أكشاك فيرجن موبايل أو داخل أكثر من 25 فرع من فروع مكتبة جرير في انحاء المملكة سيتم إرسال رمز التفعيل من خلال رسالة نصية بالإضافة إلى البريد الإلكتروني. احتفظ برمز التفعيل وبطاقة الهوية وذلك لإستلام رقمك عند زيارتك لأحد اكشاكنا. سوف يتم إلغاء حجزك إذا لم تستلمه خلال المهلة المذكورة علماً بأن الرقم سيكون متاح للحجز مرة أخرى بعد انتهاء المهلة. احجز رقمك الآن واحصل على مهلة 3 أيام لدفع الرسوم. بإمكانك دفع الرسوم لدى أي من أكشاك فيرجن موبايل أو داخل أكثر من 25 فرع من فروع مكتبة جرير في انحاء المملكة سيتم إرسال رمز التفعيل من خلال رسالة نصية بالإضافة إلى البريد الإلكتروني. احتفظ برمز التفعيل وبطاقة الهوية وذلك لإستلام رقمك عند زيارتك لأحد اكشاكنا. سوف يتم إلغاء حجزك إذا لم تستلمه خلال المهلة المذكورة علماً بأن الرقم سيكون متاح للحجز مرة أخرى بعد انتهاء المهلة. احجز رقمك الآن واحصل على مهلة 3 أيام لدفع الرسوم. بإمكانك دفع الرسوم لدى أي من أكشاك فيرجن موبايل أو داخل أكثر من 25 فرع من فروع مكتبة جرير في انحاء المملكة سيتم إرسال رمز التفعيل من خلال رسالة نصية بالإضافة إلى البريد الإلكتروني. احتفظ برمز التفعيل وبطاقة الهوية وذلك لإستلام رقمك عند زيارتك لأحد اكشاكنا. سوف يتم إلغاء حجزك إذا لم تستلمه خلال المهلة المذكورة علماً بأن الرقم سيكون متاح للحجز مرة أخرى بعد انتهاء المهلة. احجز رقمك الآن واحصل على مهلة 3 أيام لدفع الرسوم. بإمكانك دفع الرسوم لدى أي من أكشاك فيرجن موبايل أو داخل أكثر من 25 فرع من فروع مكتبة جرير في انحاء المملكة سيتم إرسال رمز التفعيل من خلال رسالة نصية بالإضافة إلى البريد الإلكتروني. احتفظ برمز التفعيل وبطاقة الهوية وذلك لإستلام رقمك عند زيارتك لأحد اكشاكنا. سوف يتم إلغاء حجزك إذا لم تستلمه خلال المهلة المذكورة علماً بأن الرقم سيكون متاح للحجز مرة أخرى بعد انتهاء المهلة. احجز رقمك الآن واحصل على مهلة 3 أيام لدفع الرسوم. بإمكانك دفع الرسوم لدى أي من أكشاك فيرجن موبايل أو داخل أكثر من 25 فرع من فروع مكتبة جرير في انحاء المملكة سيتم إرسال رمز التفعيل من خلال رسالة نصية بالإضافة إلى البريد الإلكتروني. احتفظ برمز التفعيل وبطاقة الهوية وذلك لإستلام رقمك عند زيارتك لأحد اكشاكنا. سوف يتم إلغاء حجزك إذا لم تستلمه خلال المهلة المذكورة علماً بأن الرقم سيكون متاح للحجز مرة أخرى بعد انتهاء المهلة. احجز رقمك الآن واحصل على مهلة 3 أيام لدفع الرسوم. بإمكانك دفع الرسوم لدى أي من أكشاك فيرجن موبايل أو داخل أكثر من 25 فرع من فروع مكتبة جرير في انحاء المملكة سيتم إرسال رمز التفعيل من خلال رسالة نصية بالإضافة إلى البريد الإلكتروني. احتفظ برمز التفع
                                    يل وبطاقة الهوية وذلك لإستلام رقمك عند زيارتك لأحد اكشاكنا. سوف يتم إلغاء حجزك إذا ل
                                    تستلمه خلال المهلة المذكورة علماً بأن الرقم سيكون متاح للحجز مرة أخرى بعد انتهاء المهلة. 
                        </p>
                        <hr className="lin2"/>
                        <div className="shahedTitel"> شاهد أيضًا</div>
                      
                        <div className="videos-container">
                            
                            <BlogDetailsVideo />
                            <BlogDetailsVideo />                            
                            <BlogDetailsVideo />
                            <BlogDetailsVideo />
                        
                        </div>
                        <Footer />
                </div>

        );
    }
}

export default BlogDetails;